AMR/parcelBasedAMR/tutorial/parcelInBox/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2412
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Use the standard dynamic refinement mesher
dynamicFvMesh   dynamicRefineFvMesh;

// Coefficients for the mesher
dynamicRefineFvMeshCoeffs
{
    // Enable the mesh motion/refinement
    active          true;

    // The name of the field to use for refinement.
    // This MUST match the name we gave it in the solver.
    field           particleCount;

    // --- Refinement Criteria ---
    // Refine any cell where particleCount > 0.5. Since our field is either
    // 0 or 1, this effectively refines ANY cell containing a particle.
    lowerRefineLevel 0.1;

    // A very high value to prevent un-refinement based on the upper level.
    upperRefineLevel 1000;

    // --- Un-refinement Criteria ---
    // Un-refine cells that are this many refinement levels above what they
    // "should" be. A value of 1 or 2 is usually good.
    // This cleans up the mesh behind the spray.
    unrefineLevel   2;

    nBufferLayers   3;

    // The maximum number of times a single cell can be split.
    // 2 means an original cell can become 4*4=16 cells in 2D or 8*8=64 in 3D.
    maxRefinement   2;

    // Check for refinement every N timesteps. 1 means every step.
    refineInterval  1;

    // Write the refinement level field? (Useful for debugging)
    dumpLevel       false;

    // --- Mesh Quality Controls ---
    // Prevent un-refinement if it would create a cell larger than this.
    maxCellSize     1000;
	
	maxCells		50000;
	
	correctFluxes
	(
		( phi none)
		( phi_0 none)
		( ghf none)
	);
}